DarkSoulEngineer/CC1101_DRIVER/examples/usb_interface_test/sdkconfig.defaults
# Target: ESP32-S3 (native USB Serial/JTAG controller)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# USB interface test: UART0 (COM7) carries the IDF console logs,
# the native USB Serial/JTAG port (COM6) is the interface under test
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Native USB driver ring buffers
CONFIG_USB_INTERFACE_USJ_TX_BUFFER_SIZE=512
CONFIG_USB_INTERFACE_USJ_RX_BUFFER_SIZE=512

# Enable IDF logs for debugging
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
